---
type: WorksharingDisplayGraphicSettings
namespace: Autodesk.Revit.DB
version: 2024
members: 6
tags: [revit-api, class]
---

# WorksharingDisplayGraphicSettings

`Autodesk.Revit.DB.WorksharingDisplayGraphicSettings` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | WorksharingDisplayGraphicSettings | 2012 | `public WorksharingDisplayGraphicSettings ( bool shouldApply , Color lineColor )` |
| Method | Dispose | — | `public void Dispose ()` |
| Property | FillColor | 2012 | `public Color FillColor { get ; }` |
| Property | IsApplied | 2012 | `public bool IsApplied { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | LineColor | 2012 | `public Color LineColor { get ; }` |